2022-01-22 1858
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 24, 24, 6)         156       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 12, 12, 6)         0         
_________________________________________________________________
activation (Activation)      (None, 12, 12, 6)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 8)           1208      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 4, 4, 8)           0         
_________________________________________________________________
activation_1 (Activation)    (None, 4, 4, 8)           0         
_________________________________________________________________
flatten (Flatten)            (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 120)               15480     
_________________________________________________________________
dense_1 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_2 (Dense)              (None, 10)                850       
=================================================================
Total params: 27,858
Trainable params: 27,858
Non-trainable params: 0
_________________________________________________________________
Epoch 1/40
938/938 [==============================] - 25s 21ms/step - loss: 0.0901 - accuracy: 0.1036 - val_loss: 0.0900 - val_accuracy: 0.1039
Epoch 2/40
938/938 [==============================] - 19s 20ms/step - loss: 0.0899 - accuracy: 0.1103 - val_loss: 0.0898 - val_accuracy: 0.1210
Epoch 3/40
938/938 [==============================] - 19s 20ms/step - loss: 0.0897 - accuracy: 0.1363 - val_loss: 0.0896 - val_accuracy: 0.1563
Epoch 4/40
938/938 [==============================] - 17s 18ms/step - loss: 0.0894 - accuracy: 0.1750 - val_loss: 0.0893 - val_accuracy: 0.1904
Epoch 5/40
938/938 [==============================] - 5s 6ms/step - loss: 0.0892 - accuracy: 0.2119 - val_loss: 0.0890 - val_accuracy: 0.2236
Epoch 6/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0889 - accuracy: 0.2391 - val_loss: 0.0887 - val_accuracy: 0.2504
Epoch 7/40
938/938 [==============================] - 5s 6ms/step - loss: 0.0884 - accuracy: 0.2656 - val_loss: 0.0881 - val_accuracy: 0.2794
Epoch 8/40
938/938 [==============================] - 5s 6ms/step - loss: 0.0877 - accuracy: 0.3149 - val_loss: 0.0871 - val_accuracy: 0.3451
Epoch 9/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0863 - accuracy: 0.3681 - val_loss: 0.0851 - val_accuracy: 0.4016
Epoch 10/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0834 - accuracy: 0.4248 - val_loss: 0.0808 - val_accuracy: 0.4786
Epoch 11/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0767 - accuracy: 0.5170 - val_loss: 0.0705 - val_accuracy: 0.5917
Epoch 12/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0627 - accuracy: 0.6342 - val_loss: 0.0526 - val_accuracy: 0.6999
Epoch 13/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0461 - accuracy: 0.7200 - val_loss: 0.0392 - val_accuracy: 0.7580
Epoch 14/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0364 - accuracy: 0.7628 - val_loss: 0.0318 - val_accuracy: 0.7911
Epoch 15/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0294 - accuracy: 0.8105 - val_loss: 0.0254 - val_accuracy: 0.8448
Epoch 16/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0242 - accuracy: 0.8489 - val_loss: 0.0215 - val_accuracy: 0.8666
Epoch 17/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0212 - accuracy: 0.8676 - val_loss: 0.0192 - val_accuracy: 0.8780
Epoch 18/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0194 - accuracy: 0.8785 - val_loss: 0.0178 - val_accuracy: 0.8855
Epoch 19/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0181 - accuracy: 0.8848 - val_loss: 0.0168 - val_accuracy: 0.8901
Epoch 20/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0171 - accuracy: 0.8895 - val_loss: 0.0161 - val_accuracy: 0.8957
Epoch 21/40
938/938 [==============================] - 5s 6ms/step - loss: 0.0164 - accuracy: 0.8956 - val_loss: 0.0154 - val_accuracy: 0.9015
Epoch 22/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0157 - accuracy: 0.8989 - val_loss: 0.0146 - val_accuracy: 0.9047
Epoch 23/40
938/938 [==============================] - 4s 5ms/step - loss: 0.0151 - accuracy: 0.9022 - val_loss: 0.0141 - val_accuracy: 0.9087
Epoch 24/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0146 - accuracy: 0.9059 - val_loss: 0.0137 - val_accuracy: 0.9119
Epoch 25/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0142 - accuracy: 0.9092 - val_loss: 0.0132 - val_accuracy: 0.9150
Epoch 26/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0137 - accuracy: 0.9117 - val_loss: 0.0129 - val_accuracy: 0.9187
Epoch 27/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0133 - accuracy: 0.9143 - val_loss: 0.0125 - val_accuracy: 0.9191
Epoch 28/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0130 - accuracy: 0.9166 - val_loss: 0.0120 - val_accuracy: 0.9221
Epoch 29/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0126 - accuracy: 0.9186 - val_loss: 0.0118 - val_accuracy: 0.9242
Epoch 30/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0123 - accuracy: 0.9212 - val_loss: 0.0115 - val_accuracy: 0.9255
Epoch 31/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0120 - accuracy: 0.9226 - val_loss: 0.0111 - val_accuracy: 0.9290
Epoch 32/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0117 - accuracy: 0.9242 - val_loss: 0.0109 - val_accuracy: 0.9314
Epoch 33/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0114 - accuracy: 0.9265 - val_loss: 0.0107 - val_accuracy: 0.9319
Epoch 34/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0112 - accuracy: 0.9286 - val_loss: 0.0106 - val_accuracy: 0.9322
Epoch 35/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0109 - accuracy: 0.9296 - val_loss: 0.0102 - val_accuracy: 0.9367
Epoch 36/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0107 - accuracy: 0.9312 - val_loss: 0.0100 - val_accuracy: 0.9377
Epoch 37/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0105 - accuracy: 0.9325 - val_loss: 0.0099 - val_accuracy: 0.9384
Epoch 38/40
938/938 [==============================] - 4s 5ms/step - loss: 0.0103 - accuracy: 0.9345 - val_loss: 0.0096 - val_accuracy: 0.9398
Epoch 39/40
938/938 [==============================] - 4s 5ms/step - loss: 0.0101 - accuracy: 0.9359 - val_loss: 0.0095 - val_accuracy: 0.9416
Epoch 40/40
938/938 [==============================] - 5s 5ms/step - loss: 0.0099 - accuracy: 0.9368 - val_loss: 0.0093 - val_accuracy: 0.9414
313/313 [==============================] - 1s 3ms/step - loss: 0.0093 - accuracy: 0.9414
