2022-01-20 2013
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 24, 24, 6)         156       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 12, 12, 6)         0         
_________________________________________________________________
activation (Activation)      (None, 12, 12, 6)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 8)           1208      
_________________________________________________________________
average_pooling2d (AveragePo (None, 4, 4, 8)           0         
_________________________________________________________________
activation_1 (Activation)    (None, 4, 4, 8)           0         
_________________________________________________________________
flatten (Flatten)            (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 120)               15480     
_________________________________________________________________
dense_1 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_2 (Dense)              (None, 10)                850       
=================================================================
Total params: 27,858
Trainable params: 27,858
Non-trainable params: 0
_________________________________________________________________
Epoch 1/40
938/938 [==============================] - 7s 5ms/step - loss: 17470.2695 - accuracy: 0.0852 - val_loss: 17422.7930 - val_accuracy: 0.0879
Epoch 2/40
938/938 [==============================] - 4s 5ms/step - loss: 17469.5879 - accuracy: 0.0838 - val_loss: 17422.7930 - val_accuracy: 0.0815
Epoch 3/40
938/938 [==============================] - 4s 5ms/step - loss: 17469.6172 - accuracy: 0.0829 - val_loss: 17422.7930 - val_accuracy: 0.0840
Epoch 4/40
938/938 [==============================] - 4s 5ms/step - loss: 17469.2441 - accuracy: 0.0841 - val_loss: 17422.7930 - val_accuracy: 0.0853
Epoch 5/40
938/938 [==============================] - 4s 5ms/step - loss: 17470.6211 - accuracy: 0.0842 - val_loss: 17422.7930 - val_accuracy: 0.0902
Epoch 6/40
938/938 [==============================] - 4s 5ms/step - loss: 17470.5234 - accuracy: 0.0849 - val_loss: 17422.7930 - val_accuracy: 0.0858
Epoch 7/40
938/938 [==============================] - 4s 5ms/step - loss: 17469.8438 - accuracy: 0.0843 - val_loss: 17422.7930 - val_accuracy: 0.0858
Epoch 8/40
938/938 [==============================] - 4s 5ms/step - loss: 17470.2070 - accuracy: 0.0859 - val_loss: 17422.7930 - val_accuracy: 0.0841
Epoch 9/40
938/938 [==============================] - 4s 5ms/step - loss: 17468.5410 - accuracy: 0.0868 - val_loss: 17422.7930 - val_accuracy: 0.0910
Epoch 10/40
938/938 [==============================] - 4s 4ms/step - loss: 17468.5117 - accuracy: 0.0867 - val_loss: 17422.7930 - val_accuracy: 0.0949
Epoch 11/40
938/938 [==============================] - 4s 5ms/step - loss: 17470.0039 - accuracy: 0.0879 - val_loss: 17422.7930 - val_accuracy: 0.0880
Epoch 12/40
938/938 [==============================] - 4s 5ms/step - loss: 17471.4648 - accuracy: 0.0861 - val_loss: 17422.7930 - val_accuracy: 0.0851
Epoch 13/40
938/938 [==============================] - 4s 5ms/step - loss: 17470.0820 - accuracy: 0.0874 - val_loss: 17422.7930 - val_accuracy: 0.0915
Epoch 14/40
938/938 [==============================] - 4s 5ms/step - loss: 17470.8984 - accuracy: 0.0862 - val_loss: 17422.7930 - val_accuracy: 0.0882
Epoch 15/40
938/938 [==============================] - 4s 5ms/step - loss: 17467.8359 - accuracy: 0.0878 - val_loss: 17422.7930 - val_accuracy: 0.0896
Epoch 16/40
938/938 [==============================] - 4s 5ms/step - loss: 17469.7520 - accuracy: 0.0882 - val_loss: 17422.7930 - val_accuracy: 0.0903
Epoch 17/40
938/938 [==============================] - 4s 5ms/step - loss: 17470.8047 - accuracy: 0.0890 - val_loss: 17422.7930 - val_accuracy: 0.0892
Epoch 18/40
938/938 [==============================] - 4s 5ms/step - loss: 17471.3652 - accuracy: 0.0878 - val_loss: 17422.7930 - val_accuracy: 0.0881
Epoch 19/40
938/938 [==============================] - 4s 5ms/step - loss: 17469.5625 - accuracy: 0.0903 - val_loss: 17422.7930 - val_accuracy: 0.0891
Epoch 20/40
938/938 [==============================] - 4s 5ms/step - loss: 17470.9648 - accuracy: 0.0898 - val_loss: 17422.7930 - val_accuracy: 0.0918
Epoch 21/40
