2022-01-22 1902
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 24, 24, 6)         156       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 12, 12, 6)         0         
_________________________________________________________________
activation (Activation)      (None, 12, 12, 6)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 8)           1208      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 4, 4, 8)           0         
_________________________________________________________________
activation_1 (Activation)    (None, 4, 4, 8)           0         
_________________________________________________________________
flatten (Flatten)            (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 120)               15480     
_________________________________________________________________
dense_1 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_2 (Dense)              (None, 10)                850       
=================================================================
Total params: 27,858
Trainable params: 27,858
Non-trainable params: 0
_________________________________________________________________
Epoch 1/60
1200/1200 [==============================] - 7s 4ms/step - loss: 0.0900 - accuracy: 0.1188 - val_loss: 0.0897 - val_accuracy: 0.1614
Epoch 2/60
1200/1200 [==============================] - 5s 4ms/step - loss: 0.0895 - accuracy: 0.1992 - val_loss: 0.0892 - val_accuracy: 0.2433
Epoch 3/60
1200/1200 [==============================] - 5s 4ms/step - loss: 0.0889 - accuracy: 0.2714 - val_loss: 0.0886 - val_accuracy: 0.3220
Epoch 4/60
1200/1200 [==============================] - 5s 4ms/step - loss: 0.0882 - accuracy: 0.3424 - val_loss: 0.0875 - val_accuracy: 0.3892
Epoch 5/60
