2022-01-10 2214
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 24, 24, 6)         156       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 12, 12, 6)         0         
_________________________________________________________________
activation (Activation)      (None, 12, 12, 6)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 8)           1208      
_________________________________________________________________
average_pooling2d (AveragePo (None, 4, 4, 8)           0         
_________________________________________________________________
activation_1 (Activation)    (None, 4, 4, 8)           0         
_________________________________________________________________
flatten (Flatten)            (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 120)               15480     
_________________________________________________________________
dense_1 (Dense)              (None, 84)                10164     
_________________________________________________________________
dense_2 (Dense)              (None, 10)                850       
=================================================================
Total params: 27,858
Trainable params: 27,858
Non-trainable params: 0
_________________________________________________________________
Epoch 1/40
938/938 [==============================] - 6s 4ms/step - loss: 17468.8867 - accuracy: 0.1008 - val_loss: 17422.7930 - val_accuracy: 0.1085
Epoch 2/40
938/938 [==============================] - 4s 4ms/step - loss: 17468.6992 - accuracy: 0.1021 - val_loss: 17422.7930 - val_accuracy: 0.0995
Epoch 3/40
938/938 [==============================] - 4s 4ms/step - loss: 17470.6289 - accuracy: 0.1044 - val_loss: 17422.7930 - val_accuracy: 0.1403
Epoch 4/40
938/938 [==============================] - 4s 4ms/step - loss: 17470.0039 - accuracy: 0.1122 - val_loss: 17422.7930 - val_accuracy: 0.1317
Epoch 5/40
938/938 [==============================] - 5s 5ms/step - loss: 17470.5586 - accuracy: 0.1105 - val_loss: 17422.7930 - val_accuracy: 0.1044
Epoch 6/40
938/938 [==============================] - 4s 4ms/step - loss: 17469.7656 - accuracy: 0.1106 - val_loss: 17422.7930 - val_accuracy: 0.1501
Epoch 7/40
938/938 [==============================] - 4s 4ms/step - loss: 17469.3379 - accuracy: 0.1123 - val_loss: 17422.7930 - val_accuracy: 0.1116
Epoch 8/40
938/938 [==============================] - 4s 5ms/step - loss: 17470.3477 - accuracy: 0.1097 - val_loss: 17422.7930 - val_accuracy: 0.0968
Epoch 9/40
938/938 [==============================] - 4s 5ms/step - loss: 17469.1992 - accuracy: 0.1128 - val_loss: 17422.7930 - val_accuracy: 0.0963
Epoch 10/40
938/938 [==============================] - 4s 4ms/step - loss: 17468.1211 - accuracy: 0.1088 - val_loss: 17422.7930 - val_accuracy: 0.1525
Epoch 11/40
938/938 [==============================] - 4s 5ms/step - loss: 17470.3418 - accuracy: 0.1093 - val_loss: 17422.7930 - val_accuracy: 0.1507
Epoch 12/40
938/938 [==============================] - 4s 4ms/step - loss: 17470.0488 - accuracy: 0.1094 - val_loss: 17422.7930 - val_accuracy: 0.0951
Epoch 13/40
